package lesson_28.nested;

public class nestedExample {
    //Вложенные - nested classes - статический вложенные классы
    //Внутренние классы - inner classes - просто класс (не статический класс) написан внутри другого

    /*
    1. Статический класс не имеет доступа к членам внешнего класса без явной передаче.
    Могут быть использованы независимо от внешнего класса

    2. Внутренние классы - имеют доступ ко всем полям и методам внешнего класса, даже если они объявлены private

     */

}
