package homework_13;

public class Task2 {
    // Написать метод, принимающий строку и один или два индекса (перегрузка).
    // Метод должен возвращать подстроку начиная с первого индекса (включительно)
    // и заканчивая вторым индексом (не включительно) Если индекс 1 - начиная с индекса и до конца строки.
    //
    //Функционал повторяет метод String.substring(), так что этот метод использовать не нужно.
    // Оригинальный метод ломает программу, если введены не корректные индексы.
    // Наш метод аварийно завершать программу не должен.

}
